Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/dbgu.h
/**
 * \brief Component description for DBGU
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_DBGU_COMPONENT_H_
#define _SAM9X_DBGU_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR DBGU                                         */
/* ************************************************************************** */

/* -------- DBGU_CR : (DBGU Offset: 0x00) ( /W 32) Control Register -------- */
#define DBGU_CR_RSTRX_Pos                     _U_(2)                                               /**< (DBGU_CR) Reset Receiver Position */
#define DBGU_CR_RSTRX_Msk                     (_U_(0x1) << DBGU_CR_RSTRX_Pos)                      /**< (DBGU_CR) Reset Receiver Mask */
#define DBGU_CR_RSTRX(value)                  (DBGU_CR_RSTRX_Msk & ((value) << DBGU_CR_RSTRX_Pos))
#define DBGU_CR_RSTTX_Pos                     _U_(3)                                               /**< (DBGU_CR) Reset Transmitter Position */
#define DBGU_CR_RSTTX_Msk                     (_U_(0x1) << DBGU_CR_RSTTX_Pos)                      /**< (DBGU_CR) Reset Transmitter Mask */
#define DBGU_CR_RSTTX(value)                  (DBGU_CR_RSTTX_Msk & ((value) << DBGU_CR_RSTTX_Pos))
#define DBGU_CR_RXEN_Pos                      _U_(4)                                               /**< (DBGU_CR) Receiver Enable Position */
#define DBGU_CR_RXEN_Msk                      (_U_(0x1) << DBGU_CR_RXEN_Pos)                       /**< (DBGU_CR) Receiver Enable Mask */
#define DBGU_CR_RXEN(value)                   (DBGU_CR_RXEN_Msk & ((value) << DBGU_CR_RXEN_Pos))  
#define DBGU_CR_RXDIS_Pos                     _U_(5)                                               /**< (DBGU_CR) Receiver Disable Position */
#define DBGU_CR_RXDIS_Msk                     (_U_(0x1) << DBGU_CR_RXDIS_Pos)                      /**< (DBGU_CR) Receiver Disable Mask */
#define DBGU_CR_RXDIS(value)                  (DBGU_CR_RXDIS_Msk & ((value) << DBGU_CR_RXDIS_Pos))
#define DBGU_CR_TXEN_Pos                      _U_(6)                                               /**< (DBGU_CR) Transmitter Enable Position */
#define DBGU_CR_TXEN_Msk                      (_U_(0x1) << DBGU_CR_TXEN_Pos)                       /**< (DBGU_CR) Transmitter Enable Mask */
#define DBGU_CR_TXEN(value)                   (DBGU_CR_TXEN_Msk & ((value) << DBGU_CR_TXEN_Pos))  
#define DBGU_CR_TXDIS_Pos                     _U_(7)                                               /**< (DBGU_CR) Transmitter Disable Position */
#define DBGU_CR_TXDIS_Msk                     (_U_(0x1) << DBGU_CR_TXDIS_Pos)                      /**< (DBGU_CR) Transmitter Disable Mask */
#define DBGU_CR_TXDIS(value)                  (DBGU_CR_TXDIS_Msk & ((value) << DBGU_CR_TXDIS_Pos))
#define DBGU_CR_RSTSTA_Pos                    _U_(8)                                               /**< (DBGU_CR) Reset Status Position */
#define DBGU_CR_RSTSTA_Msk                    (_U_(0x1) << DBGU_CR_RSTSTA_Pos)                     /**< (DBGU_CR) Reset Status Mask */
#define DBGU_CR_RSTSTA(value)                 (DBGU_CR_RSTSTA_Msk & ((value) << DBGU_CR_RSTSTA_Pos))
#define DBGU_CR_RETTO_Pos                     _U_(10)                                              /**< (DBGU_CR) Rearm Timeout Position */
#define DBGU_CR_RETTO_Msk                     (_U_(0x1) << DBGU_CR_RETTO_Pos)                      /**< (DBGU_CR) Rearm Timeout Mask */
#define DBGU_CR_RETTO(value)                  (DBGU_CR_RETTO_Msk & ((value) << DBGU_CR_RETTO_Pos))
#define DBGU_CR_STTTO_Pos                     _U_(11)                                              /**< (DBGU_CR) Start Timeout Position */
#define DBGU_CR_STTTO_Msk                     (_U_(0x1) << DBGU_CR_STTTO_Pos)                      /**< (DBGU_CR) Start Timeout Mask */
#define DBGU_CR_STTTO(value)                  (DBGU_CR_STTTO_Msk & ((value) << DBGU_CR_STTTO_Pos))
#define DBGU_CR_DBGE_Pos                      _U_(15)                                              /**< (DBGU_CR) Debug Enable Position */
#define DBGU_CR_DBGE_Msk                      (_U_(0x1) << DBGU_CR_DBGE_Pos)                       /**< (DBGU_CR) Debug Enable Mask */
#define DBGU_CR_DBGE(value)                   (DBGU_CR_DBGE_Msk & ((value) << DBGU_CR_DBGE_Pos))  
#define DBGU_CR_Msk                           _U_(0x00008DFC)                                      /**< (DBGU_CR) Register Mask  */


/* -------- DBGU_MR : (DBGU Offset: 0x04) (R/W 32) Mode Register -------- */
#define DBGU_MR_FILTER_Pos                    _U_(4)                                               /**< (DBGU_MR) Receiver Digital Filter Position */
#define DBGU_MR_FILTER_Msk                    (_U_(0x1) << DBGU_MR_FILTER_Pos)                     /**< (DBGU_MR) Receiver Digital Filter Mask */
#define DBGU_MR_FILTER(value)                 (DBGU_MR_FILTER_Msk & ((value) << DBGU_MR_FILTER_Pos))
#define   DBGU_MR_FILTER_DISABLED_Val         _U_(0x0)                                             /**< (DBGU_MR) DBGU does not filter the receive line.  */
#define   DBGU_MR_FILTER_ENABLED_Val          _U_(0x1)                                             /**< (DBGU_MR) DBGU filters the receive line using a three-sample filter (16x-bit clock) (2 over 3 majority).  */
#define DBGU_MR_FILTER_DISABLED               (DBGU_MR_FILTER_DISABLED_Val << DBGU_MR_FILTER_Pos)  /**< (DBGU_MR) DBGU does not filter the receive line. Position  */
#define DBGU_MR_FILTER_ENABLED                (DBGU_MR_FILTER_ENABLED_Val << DBGU_MR_FILTER_Pos)   /**< (DBGU_MR) DBGU filters the receive line using a three-sample filter (16x-bit clock) (2 over 3 majority). Position  */
#define DBGU_MR_PAR_Pos                       _U_(9)                                               /**< (DBGU_MR) Parity Type Position */
#define DBGU_MR_PAR_Msk                       (_U_(0x7) << DBGU_MR_PAR_Pos)                        /**< (DBGU_MR) Parity Type Mask */
#define DBGU_MR_PAR(value)                    (DBGU_MR_PAR_Msk & ((value) << DBGU_MR_PAR_Pos))    
#define   DBGU_MR_PAR_EVEN_Val                _U_(0x0)                                             /**< (DBGU_MR) Even Parity  */
#define   DBGU_MR_PAR_ODD_Val                 _U_(0x1)                                             /**< (DBGU_MR) Odd Parity  */
#define   DBGU_MR_PAR_SPACE_Val               _U_(0x2)                                             /**< (DBGU_MR) Space: parity forced to 0  */
#define   DBGU_MR_PAR_MARK_Val                _U_(0x3)                                             /**< (DBGU_MR) Mark: parity forced to 1  */
#define   DBGU_MR_PAR_NO_Val                  _U_(0x4)                                             /**< (DBGU_MR) No parity  */
#define DBGU_MR_PAR_EVEN                      (DBGU_MR_PAR_EVEN_Val << DBGU_MR_PAR_Pos)            /**< (DBGU_MR) Even Parity Position  */
#define DBGU_MR_PAR_ODD                       (DBGU_MR_PAR_ODD_Val << DBGU_MR_PAR_Pos)             /**< (DBGU_MR) Odd Parity Position  */
#define DBGU_MR_PAR_SPACE                     (DBGU_MR_PAR_SPACE_Val << DBGU_MR_PAR_Pos)           /**< (DBGU_MR) Space: parity forced to 0 Position  */
#define DBGU_MR_PAR_MARK                      (DBGU_MR_PAR_MARK_Val << DBGU_MR_PAR_Pos)            /**< (DBGU_MR) Mark: parity forced to 1 Position  */
#define DBGU_MR_PAR_NO                        (DBGU_MR_PAR_NO_Val << DBGU_MR_PAR_Pos)              /**< (DBGU_MR) No parity Position  */
#define DBGU_MR_CHMODE_Pos                    _U_(14)                                              /**< (DBGU_MR) Channel Mode Position */
#define DBGU_MR_CHMODE_Msk                    (_U_(0x3) << DBGU_MR_CHMODE_Pos)                     /**< (DBGU_MR) Channel Mode Mask */
#define DBGU_MR_CHMODE(value)                 (DBGU_MR_CHMODE_Msk & ((value) << DBGU_MR_CHMODE_Pos))
#define   DBGU_MR_CHMODE_NORMAL_Val           _U_(0x0)                                             /**< (DBGU_MR) Normal mode  */
#define   DBGU_MR_CHMODE_AUTOMATIC_Val        _U_(0x1)                                             /**< (DBGU_MR) Automatic echo  */
#define   DBGU_MR_CHMODE_LOCAL_LOOPBACK_Val   _U_(0x2)                                             /**< (DBGU_MR) Local loopback  */
#define   DBGU_MR_CHMODE_REMOTE_LOOPBACK_Val  _U_(0x3)                                             /**< (DBGU_MR) Remote loopback  */
#define DBGU_MR_CHMODE_NORMAL                 (DBGU_MR_CHMODE_NORMAL_Val << DBGU_MR_CHMODE_Pos)    /**< (DBGU_MR) Normal mode Position  */
#define DBGU_MR_CHMODE_AUTOMATIC              (DBGU_MR_CHMODE_AUTOMATIC_Val << DBGU_MR_CHMODE_Pos) /**< (DBGU_MR) Automatic echo Position  */
#define DBGU_MR_CHMODE_LOCAL_LOOPBACK         (DBGU_MR_CHMODE_LOCAL_LOOPBACK_Val << DBGU_MR_CHMODE_Pos) /**< (DBGU_MR) Local loopback Position  */
#define DBGU_MR_CHMODE_REMOTE_LOOPBACK        (DBGU_MR_CHMODE_REMOTE_LOOPBACK_Val << DBGU_MR_CHMODE_Pos) /**< (DBGU_MR) Remote loopback Position  */
#define DBGU_MR_Msk                           _U_(0x0000CE10)                                      /**< (DBGU_MR) Register Mask  */


/* -------- DBGU_IER : (DBGU Offset: 0x08) ( /W 32) Interrupt Enable Register -------- */
#define DBGU_IER_RXRDY_Pos                    _U_(0)                                               /**< (DBGU_IER) Enable RXRDY Interrupt Position */
#define DBGU_IER_RXRDY_Msk                    (_U_(0x1) << DBGU_IER_RXRDY_Pos)                     /**< (DBGU_IER) Enable RXRDY Interrupt Mask */
#define DBGU_IER_RXRDY(value)                 (DBGU_IER_RXRDY_Msk & ((value) << DBGU_IER_RXRDY_Pos))
#define DBGU_IER_TXRDY_Pos                    _U_(1)                                               /**< (DBGU_IER) Enable TXRDY Interrupt Position */
#define DBGU_IER_TXRDY_Msk                    (_U_(0x1) << DBGU_IER_TXRDY_Pos)                     /**< (DBGU_IER) Enable TXRDY Interrupt Mask */
#define DBGU_IER_TXRDY(value)                 (DBGU_IER_TXRDY_Msk & ((value) << DBGU_IER_TXRDY_Pos))
#define DBGU_IER_OVRE_Pos                     _U_(5)                                               /**< (DBGU_IER) Enable Overrun Error Interrupt Position */
#define DBGU_IER_OVRE_Msk                     (_U_(0x1) << DBGU_IER_OVRE_Pos)                      /**< (DBGU_IER) Enable Overrun Error Interrupt Mask */
#define DBGU_IER_OVRE(value)                  (DBGU_IER_OVRE_Msk & ((value) << DBGU_IER_OVRE_Pos))
#define DBGU_IER_FRAME_Pos                    _U_(6)                                               /**< (DBGU_IER) Enable Framing Error Interrupt Position */
#define DBGU_IER_FRAME_Msk                    (_U_(0x1) << DBGU_IER_FRAME_Pos)                     /**< (DBGU_IER) Enable Framing Error Interrupt Mask */
#define DBGU_IER_FRAME(value)                 (DBGU_IER_FRAME_Msk & ((value) << DBGU_IER_FRAME_Pos))
#define DBGU_IER_PARE_Pos                     _U_(7)                                               /**< (DBGU_IER) Enable Parity Error Interrupt Position */
#define DBGU_IER_PARE_Msk                     (_U_(0x1) << DBGU_IER_PARE_Pos)                      /**< (DBGU_IER) Enable Parity Error Interrupt Mask */
#define DBGU_IER_PARE(value)                  (DBGU_IER_PARE_Msk & ((value) << DBGU_IER_PARE_Pos))
#define DBGU_IER_TIMEOUT_Pos                  _U_(8)                                               /**< (DBGU_IER) Enable Timeout Interrupt Position */
#define DBGU_IER_TIMEOUT_Msk                  (_U_(0x1) << DBGU_IER_TIMEOUT_Pos)                   /**< (DBGU_IER) Enable Timeout Interrupt Mask */
#define DBGU_IER_TIMEOUT(value)               (DBGU_IER_TIMEOUT_Msk & ((value) << DBGU_IER_TIMEOUT_Pos))
#define DBGU_IER_TXEMPTY_Pos                  _U_(9)                                               /**< (DBGU_IER) Enable TXEMPTY Interrupt Position */
#define DBGU_IER_TXEMPTY_Msk                  (_U_(0x1) << DBGU_IER_TXEMPTY_Pos)                   /**< (DBGU_IER) Enable TXEMPTY Interrupt Mask */
#define DBGU_IER_TXEMPTY(value)               (DBGU_IER_TXEMPTY_Msk & ((value) << DBGU_IER_TXEMPTY_Pos))
#define DBGU_IER_COMMTX_Pos                   _U_(30)                                              /**< (DBGU_IER) Enable COMMTX (from ARM) Interrupt Position */
#define DBGU_IER_COMMTX_Msk                   (_U_(0x1) << DBGU_IER_COMMTX_Pos)                    /**< (DBGU_IER) Enable COMMTX (from ARM) Interrupt Mask */
#define DBGU_IER_COMMTX(value)                (DBGU_IER_COMMTX_Msk & ((value) << DBGU_IER_COMMTX_Pos))
#define DBGU_IER_COMMRX_Pos                   _U_(31)                                              /**< (DBGU_IER) Enable COMMRX (from ARM) Interrupt Position */
#define DBGU_IER_COMMRX_Msk                   (_U_(0x1) << DBGU_IER_COMMRX_Pos)                    /**< (DBGU_IER) Enable COMMRX (from ARM) Interrupt Mask */
#define DBGU_IER_COMMRX(value)                (DBGU_IER_COMMRX_Msk & ((value) << DBGU_IER_COMMRX_Pos))
#define DBGU_IER_Msk                          _U_(0xC00003E3)                                      /**< (DBGU_IER) Register Mask  */


/* -------- DBGU_IDR : (DBGU Offset: 0x0C) ( /W 32) Interrupt Disable Register -------- */
#define DBGU_IDR_RXRDY_Pos                    _U_(0)                                               /**< (DBGU_IDR) Disable RXRDY Interrupt Position */
#define DBGU_IDR_RXRDY_Msk                    (_U_(0x1) << DBGU_IDR_RXRDY_Pos)                     /**< (DBGU_IDR) Disable RXRDY Interrupt Mask */
#define DBGU_IDR_RXRDY(value)                 (DBGU_IDR_RXRDY_Msk & ((value) << DBGU_IDR_RXRDY_Pos))
#define DBGU_IDR_TXRDY_Pos                    _U_(1)                                               /**< (DBGU_IDR) Disable TXRDY Interrupt Position */
#define DBGU_IDR_TXRDY_Msk                    (_U_(0x1) << DBGU_IDR_TXRDY_Pos)                     /**< (DBGU_IDR) Disable TXRDY Interrupt Mask */
#define DBGU_IDR_TXRDY(value)                 (DBGU_IDR_TXRDY_Msk & ((value) << DBGU_IDR_TXRDY_Pos))
#define DBGU_IDR_OVRE_Pos                     _U_(5)                                               /**< (DBGU_IDR) Disable Overrun Error Interrupt Position */
#define DBGU_IDR_OVRE_Msk                     (_U_(0x1) << DBGU_IDR_OVRE_Pos)                      /**< (DBGU_IDR) Disable Overrun Error Interrupt Mask */
#define DBGU_IDR_OVRE(value)                  (DBGU_IDR_OVRE_Msk & ((value) << DBGU_IDR_OVRE_Pos))
#define DBGU_IDR_FRAME_Pos                    _U_(6)                                               /**< (DBGU_IDR) Disable Framing Error Interrupt Position */
#define DBGU_IDR_FRAME_Msk                    (_U_(0x1) << DBGU_IDR_FRAME_Pos)                     /**< (DBGU_IDR) Disable Framing Error Interrupt Mask */
#define DBGU_IDR_FRAME(value)                 (DBGU_IDR_FRAME_Msk & ((value) << DBGU_IDR_FRAME_Pos))
#define DBGU_IDR_PARE_Pos                     _U_(7)                                               /**< (DBGU_IDR) Disable Parity Error Interrupt Position */
#define DBGU_IDR_PARE_Msk                     (_U_(0x1) << DBGU_IDR_PARE_Pos)                      /**< (DBGU_IDR) Disable Parity Error Interrupt Mask */
#define DBGU_IDR_PARE(value)                  (DBGU_IDR_PARE_Msk & ((value) << DBGU_IDR_PARE_Pos))
#define DBGU_IDR_TIMEOUT_Pos                  _U_(8)                                               /**< (DBGU_IDR) Disable Timeout Interrupt Position */
#define DBGU_IDR_TIMEOUT_Msk                  (_U_(0x1) << DBGU_IDR_TIMEOUT_Pos)                   /**< (DBGU_IDR) Disable Timeout Interrupt Mask */
#define DBGU_IDR_TIMEOUT(value)               (DBGU_IDR_TIMEOUT_Msk & ((value) << DBGU_IDR_TIMEOUT_Pos))
#define DBGU_IDR_TXEMPTY_Pos                  _U_(9)                                               /**< (DBGU_IDR) Disable TXEMPTY Interrupt Position */
#define DBGU_IDR_TXEMPTY_Msk                  (_U_(0x1) << DBGU_IDR_TXEMPTY_Pos)                   /**< (DBGU_IDR) Disable TXEMPTY Interrupt Mask */
#define DBGU_IDR_TXEMPTY(value)               (DBGU_IDR_TXEMPTY_Msk & ((value) << DBGU_IDR_TXEMPTY_Pos))
#define DBGU_IDR_COMMTX_Pos                   _U_(30)                                              /**< (DBGU_IDR) Disable COMMTX (from ARM) Interrupt Position */
#define DBGU_IDR_COMMTX_Msk                   (_U_(0x1) << DBGU_IDR_COMMTX_Pos)                    /**< (DBGU_IDR) Disable COMMTX (from ARM) Interrupt Mask */
#define DBGU_IDR_COMMTX(value)                (DBGU_IDR_COMMTX_Msk & ((value) << DBGU_IDR_COMMTX_Pos))
#define DBGU_IDR_COMMRX_Pos                   _U_(31)                                              /**< (DBGU_IDR) Disable COMMRX (from ARM) Interrupt Position */
#define DBGU_IDR_COMMRX_Msk                   (_U_(0x1) << DBGU_IDR_COMMRX_Pos)                    /**< (DBGU_IDR) Disable COMMRX (from ARM) Interrupt Mask */
#define DBGU_IDR_COMMRX(value)                (DBGU_IDR_COMMRX_Msk & ((value) << DBGU_IDR_COMMRX_Pos))
#define DBGU_IDR_Msk                          _U_(0xC00003E3)                                      /**< (DBGU_IDR) Register Mask  */


/* -------- DBGU_IMR : (DBGU Offset: 0x10) ( R/ 32) Interrupt Mask Register -------- */
#define DBGU_IMR_RXRDY_Pos                    _U_(0)                                               /**< (DBGU_IMR) Mask RXRDY Interrupt Position */
#define DBGU_IMR_RXRDY_Msk                    (_U_(0x1) << DBGU_IMR_RXRDY_Pos)                     /**< (DBGU_IMR) Mask RXRDY Interrupt Mask */
#define DBGU_IMR_RXRDY(value)                 (DBGU_IMR_RXRDY_Msk & ((value) << DBGU_IMR_RXRDY_Pos))
#define DBGU_IMR_TXRDY_Pos                    _U_(1)                                               /**< (DBGU_IMR) Disable TXRDY Interrupt Position */
#define DBGU_IMR_TXRDY_Msk                    (_U_(0x1) << DBGU_IMR_TXRDY_Pos)                     /**< (DBGU_IMR) Disable TXRDY Interrupt Mask */
#define DBGU_IMR_TXRDY(value)                 (DBGU_IMR_TXRDY_Msk & ((value) << DBGU_IMR_TXRDY_Pos))
#define DBGU_IMR_OVRE_Pos                     _U_(5)                                               /**< (DBGU_IMR) Mask Overrun Error Interrupt Position */
#define DBGU_IMR_OVRE_Msk                     (_U_(0x1) << DBGU_IMR_OVRE_Pos)                      /**< (DBGU_IMR) Mask Overrun Error Interrupt Mask */
#define DBGU_IMR_OVRE(value)                  (DBGU_IMR_OVRE_Msk & ((value) << DBGU_IMR_OVRE_Pos))
#define DBGU_IMR_FRAME_Pos                    _U_(6)                                               /**< (DBGU_IMR) Mask Framing Error Interrupt Position */
#define DBGU_IMR_FRAME_Msk                    (_U_(0x1) << DBGU_IMR_FRAME_Pos)                     /**< (DBGU_IMR) Mask Framing Error Interrupt Mask */
#define DBGU_IMR_FRAME(value)                 (DBGU_IMR_FRAME_Msk & ((value) << DBGU_IMR_FRAME_Pos))
#define DBGU_IMR_PARE_Pos                     _U_(7)                                               /**< (DBGU_IMR) Mask Parity Error Interrupt Position */
#define DBGU_IMR_PARE_Msk                     (_U_(0x1) << DBGU_IMR_PARE_Pos)                      /**< (DBGU_IMR) Mask Parity Error Interrupt Mask */
#define DBGU_IMR_PARE(value)                  (DBGU_IMR_PARE_Msk & ((value) << DBGU_IMR_PARE_Pos))
#define DBGU_IMR_TIMEOUT_Pos                  _U_(8)                                               /**< (DBGU_IMR) Mask Timeout Interrupt Position */
#define DBGU_IMR_TIMEOUT_Msk                  (_U_(0x1) << DBGU_IMR_TIMEOUT_Pos)                   /**< (DBGU_IMR) Mask Timeout Interrupt Mask */
#define DBGU_IMR_TIMEOUT(value)               (DBGU_IMR_TIMEOUT_Msk & ((value) << DBGU_IMR_TIMEOUT_Pos))
#define DBGU_IMR_TXEMPTY_Pos                  _U_(9)                                               /**< (DBGU_IMR) Mask TXEMPTY Interrupt Position */
#define DBGU_IMR_TXEMPTY_Msk                  (_U_(0x1) << DBGU_IMR_TXEMPTY_Pos)                   /**< (DBGU_IMR) Mask TXEMPTY Interrupt Mask */
#define DBGU_IMR_TXEMPTY(value)               (DBGU_IMR_TXEMPTY_Msk & ((value) << DBGU_IMR_TXEMPTY_Pos))
#define DBGU_IMR_COMMTX_Pos                   _U_(30)                                              /**< (DBGU_IMR) Mask COMMTX (from ARM) Interrupt Position */
#define DBGU_IMR_COMMTX_Msk                   (_U_(0x1) << DBGU_IMR_COMMTX_Pos)                    /**< (DBGU_IMR) Mask COMMTX (from ARM) Interrupt Mask */
#define DBGU_IMR_COMMTX(value)                (DBGU_IMR_COMMTX_Msk & ((value) << DBGU_IMR_COMMTX_Pos))
#define DBGU_IMR_COMMRX_Pos                   _U_(31)                                              /**< (DBGU_IMR) Mask COMMRX (from ARM) Interrupt Position */
#define DBGU_IMR_COMMRX_Msk                   (_U_(0x1) << DBGU_IMR_COMMRX_Pos)                    /**< (DBGU_IMR) Mask COMMRX (from ARM) Interrupt Mask */
#define DBGU_IMR_COMMRX(value)                (DBGU_IMR_COMMRX_Msk & ((value) << DBGU_IMR_COMMRX_Pos))
#define DBGU_IMR_Msk                          _U_(0xC00003E3)                                      /**< (DBGU_IMR) Register Mask  */


