Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/dbgu.h
/* -------- DBGU_SR : (DBGU Offset: 0x14) ( R/ 32) Status Register -------- */
#define DBGU_SR_RXRDY_Pos                     _U_(0)                                               /**< (DBGU_SR) Receiver Ready Position */
#define DBGU_SR_RXRDY_Msk                     (_U_(0x1) << DBGU_SR_RXRDY_Pos)                      /**< (DBGU_SR) Receiver Ready Mask */
#define DBGU_SR_RXRDY(value)                  (DBGU_SR_RXRDY_Msk & ((value) << DBGU_SR_RXRDY_Pos))
#define DBGU_SR_TXRDY_Pos                     _U_(1)                                               /**< (DBGU_SR) Transmitter Ready Position */
#define DBGU_SR_TXRDY_Msk                     (_U_(0x1) << DBGU_SR_TXRDY_Pos)                      /**< (DBGU_SR) Transmitter Ready Mask */
#define DBGU_SR_TXRDY(value)                  (DBGU_SR_TXRDY_Msk & ((value) << DBGU_SR_TXRDY_Pos))
#define DBGU_SR_OVRE_Pos                      _U_(5)                                               /**< (DBGU_SR) Overrun Error Position */
#define DBGU_SR_OVRE_Msk                      (_U_(0x1) << DBGU_SR_OVRE_Pos)                       /**< (DBGU_SR) Overrun Error Mask */
#define DBGU_SR_OVRE(value)                   (DBGU_SR_OVRE_Msk & ((value) << DBGU_SR_OVRE_Pos))  
#define DBGU_SR_FRAME_Pos                     _U_(6)                                               /**< (DBGU_SR) Framing Error Position */
#define DBGU_SR_FRAME_Msk                     (_U_(0x1) << DBGU_SR_FRAME_Pos)                      /**< (DBGU_SR) Framing Error Mask */
#define DBGU_SR_FRAME(value)                  (DBGU_SR_FRAME_Msk & ((value) << DBGU_SR_FRAME_Pos))
#define DBGU_SR_PARE_Pos                      _U_(7)                                               /**< (DBGU_SR) Parity Error Position */
#define DBGU_SR_PARE_Msk                      (_U_(0x1) << DBGU_SR_PARE_Pos)                       /**< (DBGU_SR) Parity Error Mask */
#define DBGU_SR_PARE(value)                   (DBGU_SR_PARE_Msk & ((value) << DBGU_SR_PARE_Pos))  
#define DBGU_SR_TIMEOUT_Pos                   _U_(8)                                               /**< (DBGU_SR) Receiver Timeout Position */
#define DBGU_SR_TIMEOUT_Msk                   (_U_(0x1) << DBGU_SR_TIMEOUT_Pos)                    /**< (DBGU_SR) Receiver Timeout Mask */
#define DBGU_SR_TIMEOUT(value)                (DBGU_SR_TIMEOUT_Msk & ((value) << DBGU_SR_TIMEOUT_Pos))
#define DBGU_SR_TXEMPTY_Pos                   _U_(9)                                               /**< (DBGU_SR) Transmitter Empty Position */
#define DBGU_SR_TXEMPTY_Msk                   (_U_(0x1) << DBGU_SR_TXEMPTY_Pos)                    /**< (DBGU_SR) Transmitter Empty Mask */
#define DBGU_SR_TXEMPTY(value)                (DBGU_SR_TXEMPTY_Msk & ((value) << DBGU_SR_TXEMPTY_Pos))
#define DBGU_SR_SWES_Pos                      _U_(21)                                              /**< (DBGU_SR) SleepWalking Enable Status Position */
#define DBGU_SR_SWES_Msk                      (_U_(0x1) << DBGU_SR_SWES_Pos)                       /**< (DBGU_SR) SleepWalking Enable Status Mask */
#define DBGU_SR_SWES(value)                   (DBGU_SR_SWES_Msk & ((value) << DBGU_SR_SWES_Pos))  
#define DBGU_SR_CLKREQ_Pos                    _U_(22)                                              /**< (DBGU_SR) Clock Request Position */
#define DBGU_SR_CLKREQ_Msk                    (_U_(0x1) << DBGU_SR_CLKREQ_Pos)                     /**< (DBGU_SR) Clock Request Mask */
#define DBGU_SR_CLKREQ(value)                 (DBGU_SR_CLKREQ_Msk & ((value) << DBGU_SR_CLKREQ_Pos))
#define DBGU_SR_WKUPREQ_Pos                   _U_(23)                                              /**< (DBGU_SR) Wakeup Request Position */
#define DBGU_SR_WKUPREQ_Msk                   (_U_(0x1) << DBGU_SR_WKUPREQ_Pos)                    /**< (DBGU_SR) Wakeup Request Mask */
#define DBGU_SR_WKUPREQ(value)                (DBGU_SR_WKUPREQ_Msk & ((value) << DBGU_SR_WKUPREQ_Pos))
#define DBGU_SR_COMMTX_Pos                    _U_(30)                                              /**< (DBGU_SR) Debug Communication Channel Write Status Position */
#define DBGU_SR_COMMTX_Msk                    (_U_(0x1) << DBGU_SR_COMMTX_Pos)                     /**< (DBGU_SR) Debug Communication Channel Write Status Mask */
#define DBGU_SR_COMMTX(value)                 (DBGU_SR_COMMTX_Msk & ((value) << DBGU_SR_COMMTX_Pos))
#define DBGU_SR_COMMRX_Pos                    _U_(31)                                              /**< (DBGU_SR) Debug Communication Channel Read Status Position */
#define DBGU_SR_COMMRX_Msk                    (_U_(0x1) << DBGU_SR_COMMRX_Pos)                     /**< (DBGU_SR) Debug Communication Channel Read Status Mask */
#define DBGU_SR_COMMRX(value)                 (DBGU_SR_COMMRX_Msk & ((value) << DBGU_SR_COMMRX_Pos))
#define DBGU_SR_Msk                           _U_(0xC0E003E3)                                      /**< (DBGU_SR) Register Mask  */


/* -------- DBGU_RHR : (DBGU Offset: 0x18) ( R/ 32) Receive Holding Register -------- */
#define DBGU_RHR_RXCHR_Pos                    _U_(0)                                               /**< (DBGU_RHR) Received Character Position */
#define DBGU_RHR_RXCHR_Msk                    (_U_(0xFF) << DBGU_RHR_RXCHR_Pos)                    /**< (DBGU_RHR) Received Character Mask */
#define DBGU_RHR_RXCHR(value)                 (DBGU_RHR_RXCHR_Msk & ((value) << DBGU_RHR_RXCHR_Pos))
#define DBGU_RHR_Msk                          _U_(0x000000FF)                                      /**< (DBGU_RHR) Register Mask  */


/* -------- DBGU_THR : (DBGU Offset: 0x1C) ( /W 32) Transmit Holding Register -------- */
#define DBGU_THR_TXCHR_Pos                    _U_(0)                                               /**< (DBGU_THR) Character to be Transmitted Position */
#define DBGU_THR_TXCHR_Msk                    (_U_(0xFF) << DBGU_THR_TXCHR_Pos)                    /**< (DBGU_THR) Character to be Transmitted Mask */
#define DBGU_THR_TXCHR(value)                 (DBGU_THR_TXCHR_Msk & ((value) << DBGU_THR_TXCHR_Pos))
#define DBGU_THR_Msk                          _U_(0x000000FF)                                      /**< (DBGU_THR) Register Mask  */


