Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/dbgu.h
/* -------- DBGU_BRGR : (DBGU Offset: 0x20) (R/W 32) Baud Rate Generator Register -------- */
#define DBGU_BRGR_CD_Pos                      _U_(0)                                               /**< (DBGU_BRGR) Clock Divisor Position */
#define DBGU_BRGR_CD_Msk                      (_U_(0xFFFF) << DBGU_BRGR_CD_Pos)                    /**< (DBGU_BRGR) Clock Divisor Mask */
#define DBGU_BRGR_CD(value)                   (DBGU_BRGR_CD_Msk & ((value) << DBGU_BRGR_CD_Pos))  
#define DBGU_BRGR_Msk                         _U_(0x0000FFFF)                                      /**< (DBGU_BRGR) Register Mask  */


/* -------- DBGU_RTOR : (DBGU Offset: 0x28) (R/W 32) Receiver Timeout Register -------- */
#define DBGU_RTOR_TO_Pos                      _U_(0)                                               /**< (DBGU_RTOR) Timeout Value Position */
#define DBGU_RTOR_TO_Msk                      (_U_(0xFF) << DBGU_RTOR_TO_Pos)                      /**< (DBGU_RTOR) Timeout Value Mask */
#define DBGU_RTOR_TO(value)                   (DBGU_RTOR_TO_Msk & ((value) << DBGU_RTOR_TO_Pos))  
#define DBGU_RTOR_Msk                         _U_(0x000000FF)                                      /**< (DBGU_RTOR) Register Mask  */


/* -------- DBGU_CIDR : (DBGU Offset: 0x40) ( R/ 32) Chip ID Register -------- */
#define DBGU_CIDR_VERSION_Pos                 _U_(0)                                               /**< (DBGU_CIDR) Version of the Device Position */
#define DBGU_CIDR_VERSION_Msk                 (_U_(0x1F) << DBGU_CIDR_VERSION_Pos)                 /**< (DBGU_CIDR) Version of the Device Mask */
#define DBGU_CIDR_VERSION(value)              (DBGU_CIDR_VERSION_Msk & ((value) << DBGU_CIDR_VERSION_Pos))
#define DBGU_CIDR_EPROC_Pos                   _U_(5)                                               /**< (DBGU_CIDR) Embedded Processor Position */
#define DBGU_CIDR_EPROC_Msk                   (_U_(0x7) << DBGU_CIDR_EPROC_Pos)                    /**< (DBGU_CIDR) Embedded Processor Mask */
#define DBGU_CIDR_EPROC(value)                (DBGU_CIDR_EPROC_Msk & ((value) << DBGU_CIDR_EPROC_Pos))
#define   DBGU_CIDR_EPROC_ARM946ES_Val        _U_(0x1)                                             /**< (DBGU_CIDR) ARM946ES  */
#define   DBGU_CIDR_EPROC_ARM7TDMI_Val        _U_(0x2)                                             /**< (DBGU_CIDR) ARM7TDMI  */
#define   DBGU_CIDR_EPROC_CM3_Val             _U_(0x3)                                             /**< (DBGU_CIDR) Cortex-M3  */
#define   DBGU_CIDR_EPROC_ARM920T_Val         _U_(0x4)                                             /**< (DBGU_CIDR) ARM920T  */
#define   DBGU_CIDR_EPROC_ARM926EJS_Val       _U_(0x5)                                             /**< (DBGU_CIDR) ARM926EJ-S  */
#define   DBGU_CIDR_EPROC_CA5_Val             _U_(0x6)                                             /**< (DBGU_CIDR) Cortex-A5  */
#define DBGU_CIDR_EPROC_ARM946ES              (DBGU_CIDR_EPROC_ARM946ES_Val << DBGU_CIDR_EPROC_Pos) /**< (DBGU_CIDR) ARM946ES Position  */
#define DBGU_CIDR_EPROC_ARM7TDMI              (DBGU_CIDR_EPROC_ARM7TDMI_Val << DBGU_CIDR_EPROC_Pos) /**< (DBGU_CIDR) ARM7TDMI Position  */
#define DBGU_CIDR_EPROC_CM3                   (DBGU_CIDR_EPROC_CM3_Val << DBGU_CIDR_EPROC_Pos)     /**< (DBGU_CIDR) Cortex-M3 Position  */
#define DBGU_CIDR_EPROC_ARM920T               (DBGU_CIDR_EPROC_ARM920T_Val << DBGU_CIDR_EPROC_Pos) /**< (DBGU_CIDR) ARM920T Position  */
#define DBGU_CIDR_EPROC_ARM926EJS             (DBGU_CIDR_EPROC_ARM926EJS_Val << DBGU_CIDR_EPROC_Pos) /**< (DBGU_CIDR) ARM926EJ-S Position  */
#define DBGU_CIDR_EPROC_CA5                   (DBGU_CIDR_EPROC_CA5_Val << DBGU_CIDR_EPROC_Pos)     /**< (DBGU_CIDR) Cortex-A5 Position  */
#define DBGU_CIDR_NVPSIZ_Pos                  _U_(8)                                               /**< (DBGU_CIDR) Nonvolatile Program Memory Size Position */
#define DBGU_CIDR_NVPSIZ_Msk                  (_U_(0xF) << DBGU_CIDR_NVPSIZ_Pos)                   /**< (DBGU_CIDR) Nonvolatile Program Memory Size Mask */
#define DBGU_CIDR_NVPSIZ(value)               (DBGU_CIDR_NVPSIZ_Msk & ((value) << DBGU_CIDR_NVPSIZ_Pos))
#define   DBGU_CIDR_NVPSIZ_NONE_Val           _U_(0x0)                                             /**< (DBGU_CIDR) None  */
#define   DBGU_CIDR_NVPSIZ_8K_Val             _U_(0x1)                                             /**< (DBGU_CIDR) 8 Kbytes  */
#define   DBGU_CIDR_NVPSIZ_16K_Val            _U_(0x2)                                             /**< (DBGU_CIDR) 16 Kbytes  */
#define   DBGU_CIDR_NVPSIZ_32K_Val            _U_(0x3)                                             /**< (DBGU_CIDR) 32 Kbytes  */
#define   DBGU_CIDR_NVPSIZ_64K_Val            _U_(0x5)                                             /**< (DBGU_CIDR) 64 Kbytes  */
#define   DBGU_CIDR_NVPSIZ_128K_Val           _U_(0x7)                                             /**< (DBGU_CIDR) 128 Kbytes  */
#define   DBGU_CIDR_NVPSIZ_256K_Val           _U_(0x9)                                             /**< (DBGU_CIDR) 256 Kbytes  */
#define   DBGU_CIDR_NVPSIZ_512K_Val           _U_(0xA)                                             /**< (DBGU_CIDR) 512 Kbytes  */
#define   DBGU_CIDR_NVPSIZ_1024K_Val          _U_(0xC)                                             /**< (DBGU_CIDR) 1024 Kbytes  */
#define   DBGU_CIDR_NVPSIZ_2048K_Val          _U_(0xE)                                             /**< (DBGU_CIDR) 2048 Kbytes  */
#define DBGU_CIDR_NVPSIZ_NONE                 (DBGU_CIDR_NVPSIZ_NONE_Val << DBGU_CIDR_NVPSIZ_Pos)  /**< (DBGU_CIDR) None Position  */
#define DBGU_CIDR_NVPSIZ_8K                   (DBGU_CIDR_NVPSIZ_8K_Val << DBGU_CIDR_NVPSIZ_Pos)    /**< (DBGU_CIDR) 8 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ_16K                  (DBGU_CIDR_NVPSIZ_16K_Val << DBGU_CIDR_NVPSIZ_Pos)   /**< (DBGU_CIDR) 16 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ_32K                  (DBGU_CIDR_NVPSIZ_32K_Val << DBGU_CIDR_NVPSIZ_Pos)   /**< (DBGU_CIDR) 32 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ_64K                  (DBGU_CIDR_NVPSIZ_64K_Val << DBGU_CIDR_NVPSIZ_Pos)   /**< (DBGU_CIDR) 64 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ_128K                 (DBGU_CIDR_NVPSIZ_128K_Val << DBGU_CIDR_NVPSIZ_Pos)  /**< (DBGU_CIDR) 128 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ_256K                 (DBGU_CIDR_NVPSIZ_256K_Val << DBGU_CIDR_NVPSIZ_Pos)  /**< (DBGU_CIDR) 256 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ_512K                 (DBGU_CIDR_NVPSIZ_512K_Val << DBGU_CIDR_NVPSIZ_Pos)  /**< (DBGU_CIDR) 512 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ_1024K                (DBGU_CIDR_NVPSIZ_1024K_Val << DBGU_CIDR_NVPSIZ_Pos) /**< (DBGU_CIDR) 1024 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ_2048K                (DBGU_CIDR_NVPSIZ_2048K_Val << DBGU_CIDR_NVPSIZ_Pos) /**< (DBGU_CIDR) 2048 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ2_Pos                 _U_(12)                                              /**< (DBGU_CIDR) Second Nonvolatile Program Memory Size Position */
#define DBGU_CIDR_NVPSIZ2_Msk                 (_U_(0xF) << DBGU_CIDR_NVPSIZ2_Pos)                  /**< (DBGU_CIDR) Second Nonvolatile Program Memory Size Mask */
#define DBGU_CIDR_NVPSIZ2(value)              (DBGU_CIDR_NVPSIZ2_Msk & ((value) << DBGU_CIDR_NVPSIZ2_Pos))
#define   DBGU_CIDR_NVPSIZ2_NONE_Val          _U_(0x0)                                             /**< (DBGU_CIDR) None  */
#define   DBGU_CIDR_NVPSIZ2_8K_Val            _U_(0x1)                                             /**< (DBGU_CIDR) 8 Kbytes  */
#define   DBGU_CIDR_NVPSIZ2_16K_Val           _U_(0x2)                                             /**< (DBGU_CIDR) 16 Kbytes  */
#define   DBGU_CIDR_NVPSIZ2_32K_Val           _U_(0x3)                                             /**< (DBGU_CIDR) 32 Kbytes  */
#define   DBGU_CIDR_NVPSIZ2_64K_Val           _U_(0x5)                                             /**< (DBGU_CIDR) 64 Kbytes  */
#define   DBGU_CIDR_NVPSIZ2_128K_Val          _U_(0x7)                                             /**< (DBGU_CIDR) 128 Kbytes  */
#define   DBGU_CIDR_NVPSIZ2_256K_Val          _U_(0x9)                                             /**< (DBGU_CIDR) 256 Kbytes  */
#define   DBGU_CIDR_NVPSIZ2_512K_Val          _U_(0xA)                                             /**< (DBGU_CIDR) 512 Kbytes  */
#define   DBGU_CIDR_NVPSIZ2_1024K_Val         _U_(0xC)                                             /**< (DBGU_CIDR) 1024 Kbytes  */
#define   DBGU_CIDR_NVPSIZ2_2048K_Val         _U_(0xE)                                             /**< (DBGU_CIDR) 2048 Kbytes  */
#define DBGU_CIDR_NVPSIZ2_NONE                (DBGU_CIDR_NVPSIZ2_NONE_Val << DBGU_CIDR_NVPSIZ2_Pos) /**< (DBGU_CIDR) None Position  */
#define DBGU_CIDR_NVPSIZ2_8K                  (DBGU_CIDR_NVPSIZ2_8K_Val << DBGU_CIDR_NVPSIZ2_Pos)  /**< (DBGU_CIDR) 8 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ2_16K                 (DBGU_CIDR_NVPSIZ2_16K_Val << DBGU_CIDR_NVPSIZ2_Pos) /**< (DBGU_CIDR) 16 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ2_32K                 (DBGU_CIDR_NVPSIZ2_32K_Val << DBGU_CIDR_NVPSIZ2_Pos) /**< (DBGU_CIDR) 32 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ2_64K                 (DBGU_CIDR_NVPSIZ2_64K_Val << DBGU_CIDR_NVPSIZ2_Pos) /**< (DBGU_CIDR) 64 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ2_128K                (DBGU_CIDR_NVPSIZ2_128K_Val << DBGU_CIDR_NVPSIZ2_Pos) /**< (DBGU_CIDR) 128 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ2_256K                (DBGU_CIDR_NVPSIZ2_256K_Val << DBGU_CIDR_NVPSIZ2_Pos) /**< (DBGU_CIDR) 256 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ2_512K                (DBGU_CIDR_NVPSIZ2_512K_Val << DBGU_CIDR_NVPSIZ2_Pos) /**< (DBGU_CIDR) 512 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ2_1024K               (DBGU_CIDR_NVPSIZ2_1024K_Val << DBGU_CIDR_NVPSIZ2_Pos) /**< (DBGU_CIDR) 1024 Kbytes Position  */
#define DBGU_CIDR_NVPSIZ2_2048K               (DBGU_CIDR_NVPSIZ2_2048K_Val << DBGU_CIDR_NVPSIZ2_Pos) /**< (DBGU_CIDR) 2048 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_Pos                 _U_(16)                                              /**< (DBGU_CIDR) Internal SRAM Size Position */
#define DBGU_CIDR_SRAMSIZ_Msk                 (_U_(0xF) << DBGU_CIDR_SRAMSIZ_Pos)                  /**< (DBGU_CIDR) Internal SRAM Size Mask */
#define DBGU_CIDR_SRAMSIZ(value)              (DBGU_CIDR_SRAMSIZ_Msk & ((value) << DBGU_CIDR_SRAMSIZ_Pos))
#define   DBGU_CIDR_SRAMSIZ_1K_Val            _U_(0x1)                                             /**< (DBGU_CIDR) 1 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_2K_Val            _U_(0x2)                                             /**< (DBGU_CIDR) 2 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_6K_Val            _U_(0x3)                                             /**< (DBGU_CIDR) 6 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_112K_Val          _U_(0x4)                                             /**< (DBGU_CIDR) 112 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_4K_Val            _U_(0x5)                                             /**< (DBGU_CIDR) 4 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_80K_Val           _U_(0x6)                                             /**< (DBGU_CIDR) 80 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_160K_Val          _U_(0x7)                                             /**< (DBGU_CIDR) 160 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_8K_Val            _U_(0x8)                                             /**< (DBGU_CIDR) 8 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_16K_Val           _U_(0x9)                                             /**< (DBGU_CIDR) 16 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_32K_Val           _U_(0xA)                                             /**< (DBGU_CIDR) 32 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_64K_Val           _U_(0xB)                                             /**< (DBGU_CIDR) 64 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_128K_Val          _U_(0xC)                                             /**< (DBGU_CIDR) 128 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_256K_Val          _U_(0xD)                                             /**< (DBGU_CIDR) 256 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_96K_Val           _U_(0xE)                                             /**< (DBGU_CIDR) 96 Kbytes  */
#define   DBGU_CIDR_SRAMSIZ_512K_Val          _U_(0xF)                                             /**< (DBGU_CIDR) 512 Kbytes  */
#define DBGU_CIDR_SRAMSIZ_1K                  (DBGU_CIDR_SRAMSIZ_1K_Val << DBGU_CIDR_SRAMSIZ_Pos)  /**< (DBGU_CIDR) 1 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_2K                  (DBGU_CIDR_SRAMSIZ_2K_Val << DBGU_CIDR_SRAMSIZ_Pos)  /**< (DBGU_CIDR) 2 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_6K                  (DBGU_CIDR_SRAMSIZ_6K_Val << DBGU_CIDR_SRAMSIZ_Pos)  /**< (DBGU_CIDR) 6 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_112K                (DBGU_CIDR_SRAMSIZ_112K_Val << DBGU_CIDR_SRAMSIZ_Pos) /**< (DBGU_CIDR) 112 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_4K                  (DBGU_CIDR_SRAMSIZ_4K_Val << DBGU_CIDR_SRAMSIZ_Pos)  /**< (DBGU_CIDR) 4 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_80K                 (DBGU_CIDR_SRAMSIZ_80K_Val << DBGU_CIDR_SRAMSIZ_Pos) /**< (DBGU_CIDR) 80 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_160K                (DBGU_CIDR_SRAMSIZ_160K_Val << DBGU_CIDR_SRAMSIZ_Pos) /**< (DBGU_CIDR) 160 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_8K                  (DBGU_CIDR_SRAMSIZ_8K_Val << DBGU_CIDR_SRAMSIZ_Pos)  /**< (DBGU_CIDR) 8 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_16K                 (DBGU_CIDR_SRAMSIZ_16K_Val << DBGU_CIDR_SRAMSIZ_Pos) /**< (DBGU_CIDR) 16 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_32K                 (DBGU_CIDR_SRAMSIZ_32K_Val << DBGU_CIDR_SRAMSIZ_Pos) /**< (DBGU_CIDR) 32 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_64K                 (DBGU_CIDR_SRAMSIZ_64K_Val << DBGU_CIDR_SRAMSIZ_Pos) /**< (DBGU_CIDR) 64 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_128K                (DBGU_CIDR_SRAMSIZ_128K_Val << DBGU_CIDR_SRAMSIZ_Pos) /**< (DBGU_CIDR) 128 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_256K                (DBGU_CIDR_SRAMSIZ_256K_Val << DBGU_CIDR_SRAMSIZ_Pos) /**< (DBGU_CIDR) 256 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_96K                 (DBGU_CIDR_SRAMSIZ_96K_Val << DBGU_CIDR_SRAMSIZ_Pos) /**< (DBGU_CIDR) 96 Kbytes Position  */
#define DBGU_CIDR_SRAMSIZ_512K                (DBGU_CIDR_SRAMSIZ_512K_Val << DBGU_CIDR_SRAMSIZ_Pos) /**< (DBGU_CIDR) 512 Kbytes Position  */
#define DBGU_CIDR_ARCH_Pos                    _U_(20)                                              /**< (DBGU_CIDR) Architecture Identifier Position */
#define DBGU_CIDR_ARCH_Msk                    (_U_(0xFF) << DBGU_CIDR_ARCH_Pos)                    /**< (DBGU_CIDR) Architecture Identifier Mask */
#define DBGU_CIDR_ARCH(value)                 (DBGU_CIDR_ARCH_Msk & ((value) << DBGU_CIDR_ARCH_Pos))
#define   DBGU_CIDR_ARCH_AT91SAM9xx_Val       _U_(0x19)                                            /**< (DBGU_CIDR) AT91SAM9xx Series  */
#define   DBGU_CIDR_ARCH_AT91SAM9XExx_Val     _U_(0x29)                                            /**< (DBGU_CIDR) AT91SAM9XExx Series  */
#define   DBGU_CIDR_ARCH_AT91x34_Val          _U_(0x34)                                            /**< (DBGU_CIDR) AT91x34 Series  */
#define   DBGU_CIDR_ARCH_CAP7_Val             _U_(0x37)                                            /**< (DBGU_CIDR) CAP7 Series  */
#define   DBGU_CIDR_ARCH_CAP9_Val             _U_(0x39)                                            /**< (DBGU_CIDR) CAP9 Series  */
#define   DBGU_CIDR_ARCH_CAP11_Val            _U_(0x3B)                                            /**< (DBGU_CIDR) CAP11 Series  */
#define   DBGU_CIDR_ARCH_AT91x40_Val          _U_(0x40)                                            /**< (DBGU_CIDR) AT91x40 Series  */
#define   DBGU_CIDR_ARCH_AT91x42_Val          _U_(0x42)                                            /**< (DBGU_CIDR) AT91x42 Series  */
#define   DBGU_CIDR_ARCH_AT91x55_Val          _U_(0x55)                                            /**< (DBGU_CIDR) AT91x55 Series  */
#define   DBGU_CIDR_ARCH_AT91SAM7Axx_Val      _U_(0x60)                                            /**< (DBGU_CIDR) AT91SAM7Axx Series  */
#define   DBGU_CIDR_ARCH_AT91SAM7AQxx_Val     _U_(0x61)                                            /**< (DBGU_CIDR) AT91SAM7AQxx Series  */
#define   DBGU_CIDR_ARCH_AT91x63_Val          _U_(0x63)                                            /**< (DBGU_CIDR) AT91x63 Series  */
#define   DBGU_CIDR_ARCH_AT91SAM7Sxx_Val      _U_(0x70)                                            /**< (DBGU_CIDR) AT91SAM7Sxx Series  */
#define   DBGU_CIDR_ARCH_AT91SAM7XCxx_Val     _U_(0x71)                                            /**< (DBGU_CIDR) AT91SAM7XCxx Series  */
#define   DBGU_CIDR_ARCH_AT91SAM7SExx_Val     _U_(0x72)                                            /**< (DBGU_CIDR) AT91SAM7SExx Series  */
#define   DBGU_CIDR_ARCH_AT91SAM7Lxx_Val      _U_(0x73)                                            /**< (DBGU_CIDR) AT91SAM7Lxx Series  */
#define   DBGU_CIDR_ARCH_AT91SAM7Xxx_Val      _U_(0x75)                                            /**< (DBGU_CIDR) AT91SAM7Xxx Series  */
#define   DBGU_CIDR_ARCH_AT91SAM7SLxx_Val     _U_(0x76)                                            /**< (DBGU_CIDR) AT91SAM7SLxx Series  */
#define   DBGU_CIDR_ARCH_ATSAM3UxC_Val        _U_(0x80)                                            /**< (DBGU_CIDR) ATSAM3UxC Series (100-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAM3UxE_Val        _U_(0x81)                                            /**< (DBGU_CIDR) ATSAM3UxE Series (144-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAM3AxC_Val        _U_(0x83)                                            /**< (DBGU_CIDR) ATSAM3AxC Series (100-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAM3XxC_Val        _U_(0x84)                                            /**< (DBGU_CIDR) ATSAM3XxC Series (100-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAM3XxE_Val        _U_(0x85)                                            /**< (DBGU_CIDR) ATSAM3XxE Series (144-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAM3XxG_Val        _U_(0x86)                                            /**< (DBGU_CIDR) ATSAM3XxG Series (208/217-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAM3SxA_Val        _U_(0x88)                                            /**< (DBGU_CIDR) ATSAM3SxA Series (48-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAM3SxB_Val        _U_(0x89)                                            /**< (DBGU_CIDR) ATSAM3SxB Series (64-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAM3SxC_Val        _U_(0x8A)                                            /**< (DBGU_CIDR) ATSAM3SxC Series (100-pin version)  */
#define   DBGU_CIDR_ARCH_AT91x92_Val          _U_(0x92)                                            /**< (DBGU_CIDR) AT91x92 Series  */
#define   DBGU_CIDR_ARCH_ATSAM3NxA_Val        _U_(0x93)                                            /**< (DBGU_CIDR) ATSAM3NxA Series (48-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAM3NxB_Val        _U_(0x94)                                            /**< (DBGU_CIDR) ATSAM3NxB Series (64-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAM3NxC_Val        _U_(0x95)                                            /**< (DBGU_CIDR) ATSAM3NxC Series (100-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAM3SDxA_Val       _U_(0x98)                                            /**< (DBGU_CIDR) ATSAM3SDxA Series (48-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAM3SDxB_Val       _U_(0x99)                                            /**< (DBGU_CIDR) ATSAM3SDxB Series (64-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAM3SDxC_Val       _U_(0x9A)                                            /**< (DBGU_CIDR) ATSAM3SDxC Series (100-pin version)  */
#define   DBGU_CIDR_ARCH_ATSAMA5xx_Val        _U_(0xA5)                                            /**< (DBGU_CIDR) ATSAMA5xx Series  */
#define   DBGU_CIDR_ARCH_AT75Cxx_Val          _U_(0xF0)                                            /**< (DBGU_CIDR) AT75Cxx Series  */
#define DBGU_CIDR_ARCH_AT91SAM9xx             (DBGU_CIDR_ARCH_AT91SAM9xx_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) AT91SAM9xx Series Position  */
#define DBGU_CIDR_ARCH_AT91SAM9XExx           (DBGU_CIDR_ARCH_AT91SAM9XExx_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) AT91SAM9XExx Series Position  */
#define DBGU_CIDR_ARCH_AT91x34                (DBGU_CIDR_ARCH_AT91x34_Val << DBGU_CIDR_ARCH_Pos)   /**< (DBGU_CIDR) AT91x34 Series Position  */
#define DBGU_CIDR_ARCH_CAP7                   (DBGU_CIDR_ARCH_CAP7_Val << DBGU_CIDR_ARCH_Pos)      /**< (DBGU_CIDR) CAP7 Series Position  */
#define DBGU_CIDR_ARCH_CAP9                   (DBGU_CIDR_ARCH_CAP9_Val << DBGU_CIDR_ARCH_Pos)      /**< (DBGU_CIDR) CAP9 Series Position  */
#define DBGU_CIDR_ARCH_CAP11                  (DBGU_CIDR_ARCH_CAP11_Val << DBGU_CIDR_ARCH_Pos)     /**< (DBGU_CIDR) CAP11 Series Position  */
#define DBGU_CIDR_ARCH_AT91x40                (DBGU_CIDR_ARCH_AT91x40_Val << DBGU_CIDR_ARCH_Pos)   /**< (DBGU_CIDR) AT91x40 Series Position  */
#define DBGU_CIDR_ARCH_AT91x42                (DBGU_CIDR_ARCH_AT91x42_Val << DBGU_CIDR_ARCH_Pos)   /**< (DBGU_CIDR) AT91x42 Series Position  */
#define DBGU_CIDR_ARCH_AT91x55                (DBGU_CIDR_ARCH_AT91x55_Val << DBGU_CIDR_ARCH_Pos)   /**< (DBGU_CIDR) AT91x55 Series Position  */
#define DBGU_CIDR_ARCH_AT91SAM7Axx            (DBGU_CIDR_ARCH_AT91SAM7Axx_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) AT91SAM7Axx Series Position  */
#define DBGU_CIDR_ARCH_AT91SAM7AQxx           (DBGU_CIDR_ARCH_AT91SAM7AQxx_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) AT91SAM7AQxx Series Position  */
#define DBGU_CIDR_ARCH_AT91x63                (DBGU_CIDR_ARCH_AT91x63_Val << DBGU_CIDR_ARCH_Pos)   /**< (DBGU_CIDR) AT91x63 Series Position  */
#define DBGU_CIDR_ARCH_AT91SAM7Sxx            (DBGU_CIDR_ARCH_AT91SAM7Sxx_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) AT91SAM7Sxx Series Position  */
#define DBGU_CIDR_ARCH_AT91SAM7XCxx           (DBGU_CIDR_ARCH_AT91SAM7XCxx_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) AT91SAM7XCxx Series Position  */
#define DBGU_CIDR_ARCH_AT91SAM7SExx           (DBGU_CIDR_ARCH_AT91SAM7SExx_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) AT91SAM7SExx Series Position  */
#define DBGU_CIDR_ARCH_AT91SAM7Lxx            (DBGU_CIDR_ARCH_AT91SAM7Lxx_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) AT91SAM7Lxx Series Position  */
#define DBGU_CIDR_ARCH_AT91SAM7Xxx            (DBGU_CIDR_ARCH_AT91SAM7Xxx_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) AT91SAM7Xxx Series Position  */
#define DBGU_CIDR_ARCH_AT91SAM7SLxx           (DBGU_CIDR_ARCH_AT91SAM7SLxx_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) AT91SAM7SLxx Series Position  */
#define DBGU_CIDR_ARCH_ATSAM3UxC              (DBGU_CIDR_ARCH_ATSAM3UxC_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3UxC Series (100-pin version) Position  */
#define DBGU_CIDR_ARCH_ATSAM3UxE              (DBGU_CIDR_ARCH_ATSAM3UxE_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3UxE Series (144-pin version) Position  */
#define DBGU_CIDR_ARCH_ATSAM3AxC              (DBGU_CIDR_ARCH_ATSAM3AxC_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3AxC Series (100-pin version) Position  */
#define DBGU_CIDR_ARCH_ATSAM3XxC              (DBGU_CIDR_ARCH_ATSAM3XxC_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3XxC Series (100-pin version) Position  */
#define DBGU_CIDR_ARCH_ATSAM3XxE              (DBGU_CIDR_ARCH_ATSAM3XxE_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3XxE Series (144-pin version) Position  */
#define DBGU_CIDR_ARCH_ATSAM3XxG              (DBGU_CIDR_ARCH_ATSAM3XxG_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3XxG Series (208/217-pin version) Position  */
#define DBGU_CIDR_ARCH_ATSAM3SxA              (DBGU_CIDR_ARCH_ATSAM3SxA_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3SxA Series (48-pin version) Position  */
