Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/dbgu.h
#define DBGU_CIDR_ARCH_ATSAM3SxB              (DBGU_CIDR_ARCH_ATSAM3SxB_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3SxB Series (64-pin version) Position  */
#define DBGU_CIDR_ARCH_ATSAM3SxC              (DBGU_CIDR_ARCH_ATSAM3SxC_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3SxC Series (100-pin version) Position  */
#define DBGU_CIDR_ARCH_AT91x92                (DBGU_CIDR_ARCH_AT91x92_Val << DBGU_CIDR_ARCH_Pos)   /**< (DBGU_CIDR) AT91x92 Series Position  */
#define DBGU_CIDR_ARCH_ATSAM3NxA              (DBGU_CIDR_ARCH_ATSAM3NxA_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3NxA Series (48-pin version) Position  */
#define DBGU_CIDR_ARCH_ATSAM3NxB              (DBGU_CIDR_ARCH_ATSAM3NxB_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3NxB Series (64-pin version) Position  */
#define DBGU_CIDR_ARCH_ATSAM3NxC              (DBGU_CIDR_ARCH_ATSAM3NxC_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3NxC Series (100-pin version) Position  */
#define DBGU_CIDR_ARCH_ATSAM3SDxA             (DBGU_CIDR_ARCH_ATSAM3SDxA_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3SDxA Series (48-pin version) Position  */
#define DBGU_CIDR_ARCH_ATSAM3SDxB             (DBGU_CIDR_ARCH_ATSAM3SDxB_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3SDxB Series (64-pin version) Position  */
#define DBGU_CIDR_ARCH_ATSAM3SDxC             (DBGU_CIDR_ARCH_ATSAM3SDxC_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAM3SDxC Series (100-pin version) Position  */
#define DBGU_CIDR_ARCH_ATSAMA5xx              (DBGU_CIDR_ARCH_ATSAMA5xx_Val << DBGU_CIDR_ARCH_Pos) /**< (DBGU_CIDR) ATSAMA5xx Series Position  */
#define DBGU_CIDR_ARCH_AT75Cxx                (DBGU_CIDR_ARCH_AT75Cxx_Val << DBGU_CIDR_ARCH_Pos)   /**< (DBGU_CIDR) AT75Cxx Series Position  */
#define DBGU_CIDR_NVPTYP_Pos                  _U_(28)                                              /**< (DBGU_CIDR) Nonvolatile Program Memory Type Position */
#define DBGU_CIDR_NVPTYP_Msk                  (_U_(0x7) << DBGU_CIDR_NVPTYP_Pos)                   /**< (DBGU_CIDR) Nonvolatile Program Memory Type Mask */
#define DBGU_CIDR_NVPTYP(value)               (DBGU_CIDR_NVPTYP_Msk & ((value) << DBGU_CIDR_NVPTYP_Pos))
#define   DBGU_CIDR_NVPTYP_ROM_Val            _U_(0x0)                                             /**< (DBGU_CIDR) ROM  */
#define   DBGU_CIDR_NVPTYP_ROMLESS_Val        _U_(0x1)                                             /**< (DBGU_CIDR) ROMless or on-chip Flash  */
#define   DBGU_CIDR_NVPTYP_FLASH_Val          _U_(0x2)                                             /**< (DBGU_CIDR) Embedded Flash Memory  */
#define   DBGU_CIDR_NVPTYP_ROM_FLASH_Val      _U_(0x3)                                             /**< (DBGU_CIDR) ROM and Embedded Flash MemoryNVPSIZ is ROM size NVPSIZ2 is Flash size  */
#define   DBGU_CIDR_NVPTYP_SRAM_Val           _U_(0x4)                                             /**< (DBGU_CIDR) SRAM emulating ROM  */
#define DBGU_CIDR_NVPTYP_ROM                  (DBGU_CIDR_NVPTYP_ROM_Val << DBGU_CIDR_NVPTYP_Pos)   /**< (DBGU_CIDR) ROM Position  */
#define DBGU_CIDR_NVPTYP_ROMLESS              (DBGU_CIDR_NVPTYP_ROMLESS_Val << DBGU_CIDR_NVPTYP_Pos) /**< (DBGU_CIDR) ROMless or on-chip Flash Position  */
#define DBGU_CIDR_NVPTYP_FLASH                (DBGU_CIDR_NVPTYP_FLASH_Val << DBGU_CIDR_NVPTYP_Pos) /**< (DBGU_CIDR) Embedded Flash Memory Position  */
#define DBGU_CIDR_NVPTYP_ROM_FLASH            (DBGU_CIDR_NVPTYP_ROM_FLASH_Val << DBGU_CIDR_NVPTYP_Pos) /**< (DBGU_CIDR) ROM and Embedded Flash MemoryNVPSIZ is ROM size NVPSIZ2 is Flash size Position  */
#define DBGU_CIDR_NVPTYP_SRAM                 (DBGU_CIDR_NVPTYP_SRAM_Val << DBGU_CIDR_NVPTYP_Pos)  /**< (DBGU_CIDR) SRAM emulating ROM Position  */
#define DBGU_CIDR_EXT_Pos                     _U_(31)                                              /**< (DBGU_CIDR) Extension Flag Position */
#define DBGU_CIDR_EXT_Msk                     (_U_(0x1) << DBGU_CIDR_EXT_Pos)                      /**< (DBGU_CIDR) Extension Flag Mask */
#define DBGU_CIDR_EXT(value)                  (DBGU_CIDR_EXT_Msk & ((value) << DBGU_CIDR_EXT_Pos))
#define DBGU_CIDR_Msk                         _U_(0xFFFFFFFF)                                      /**< (DBGU_CIDR) Register Mask  */


/* -------- DBGU_EXID : (DBGU Offset: 0x44) ( R/ 32) Chip ID Extension Register -------- */
#define DBGU_EXID_EXID_Pos                    _U_(0)                                               /**< (DBGU_EXID) Chip ID Extension Position */
#define DBGU_EXID_EXID_Msk                    (_U_(0xFFFFFFFF) << DBGU_EXID_EXID_Pos)              /**< (DBGU_EXID) Chip ID Extension Mask */
#define DBGU_EXID_EXID(value)                 (DBGU_EXID_EXID_Msk & ((value) << DBGU_EXID_EXID_Pos))
#define DBGU_EXID_Msk                         _U_(0xFFFFFFFF)                                      /**< (DBGU_EXID) Register Mask  */


/* -------- DBGU_FNR : (DBGU Offset: 0x48) (R/W 32) Force NTRST Register -------- */
#define DBGU_FNR_FNTRST_Pos                   _U_(0)                                               /**< (DBGU_FNR) Force NTRST Position */
#define DBGU_FNR_FNTRST_Msk                   (_U_(0x1) << DBGU_FNR_FNTRST_Pos)                    /**< (DBGU_FNR) Force NTRST Mask */
#define DBGU_FNR_FNTRST(value)                (DBGU_FNR_FNTRST_Msk & ((value) << DBGU_FNR_FNTRST_Pos))
#define DBGU_FNR_Msk                          _U_(0x00000001)                                      /**< (DBGU_FNR) Register Mask  */


/* -------- DBGU_WPMR : (DBGU Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define DBGU_WPMR_WPEN_Pos                    _U_(0)                                               /**< (DBGU_WPMR) Write Protection Enable Position */
#define DBGU_WPMR_WPEN_Msk                    (_U_(0x1) << DBGU_WPMR_WPEN_Pos)                     /**< (DBGU_WPMR) Write Protection Enable Mask */
#define DBGU_WPMR_WPEN(value)                 (DBGU_WPMR_WPEN_Msk & ((value) << DBGU_WPMR_WPEN_Pos))
#define DBGU_WPMR_WPKEY_Pos                   _U_(8)                                               /**< (DBGU_WPMR) Write Protection Key Position */
#define DBGU_WPMR_WPKEY_Msk                   (_U_(0xFFFFFF) << DBGU_WPMR_WPKEY_Pos)               /**< (DBGU_WPMR) Write Protection Key Mask */
#define DBGU_WPMR_WPKEY(value)                (DBGU_WPMR_WPKEY_Msk & ((value) << DBGU_WPMR_WPKEY_Pos))
#define   DBGU_WPMR_WPKEY_PASSWD_Val          _U_(0x554152)                                        /**< (DBGU_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define DBGU_WPMR_WPKEY_PASSWD                (DBGU_WPMR_WPKEY_PASSWD_Val << DBGU_WPMR_WPKEY_Pos)  /**< (DBGU_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define DBGU_WPMR_Msk                         _U_(0xFFFFFF01)                                      /**< (DBGU_WPMR) Register Mask  */


