Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/dbgu.h
/* -------- DBGU_VERSION : (DBGU Offset: 0xFC) ( R/ 32) Version Register -------- */
#define DBGU_VERSION_VERSION_Pos              _U_(0)                                               /**< (DBGU_VERSION) Hardware Module Version Position */
#define DBGU_VERSION_VERSION_Msk              (_U_(0xFFF) << DBGU_VERSION_VERSION_Pos)             /**< (DBGU_VERSION) Hardware Module Version Mask */
#define DBGU_VERSION_VERSION(value)           (DBGU_VERSION_VERSION_Msk & ((value) << DBGU_VERSION_VERSION_Pos))
#define DBGU_VERSION_MFN_Pos                  _U_(16)                                              /**< (DBGU_VERSION) Metal Fix Number Position */
#define DBGU_VERSION_MFN_Msk                  (_U_(0x7) << DBGU_VERSION_MFN_Pos)                   /**< (DBGU_VERSION) Metal Fix Number Mask */
#define DBGU_VERSION_MFN(value)               (DBGU_VERSION_MFN_Msk & ((value) << DBGU_VERSION_MFN_Pos))
#define DBGU_VERSION_Msk                      _U_(0x00070FFF)                                      /**< (DBGU_VERSION) Register Mask  */


/** \brief DBGU register offsets definitions */
#define DBGU_CR_REG_OFST               (0x00)              /**< (DBGU_CR) Control Register Offset */
#define DBGU_MR_REG_OFST               (0x04)              /**< (DBGU_MR) Mode Register Offset */
#define DBGU_IER_REG_OFST              (0x08)              /**< (DBGU_IER) Interrupt Enable Register Offset */
#define DBGU_IDR_REG_OFST              (0x0C)              /**< (DBGU_IDR) Interrupt Disable Register Offset */
#define DBGU_IMR_REG_OFST              (0x10)              /**< (DBGU_IMR) Interrupt Mask Register Offset */
#define DBGU_SR_REG_OFST               (0x14)              /**< (DBGU_SR) Status Register Offset */
#define DBGU_RHR_REG_OFST              (0x18)              /**< (DBGU_RHR) Receive Holding Register Offset */
#define DBGU_THR_REG_OFST              (0x1C)              /**< (DBGU_THR) Transmit Holding Register Offset */
#define DBGU_BRGR_REG_OFST             (0x20)              /**< (DBGU_BRGR) Baud Rate Generator Register Offset */
#define DBGU_RTOR_REG_OFST             (0x28)              /**< (DBGU_RTOR) Receiver Timeout Register Offset */
#define DBGU_CIDR_REG_OFST             (0x40)              /**< (DBGU_CIDR) Chip ID Register Offset */
#define DBGU_EXID_REG_OFST             (0x44)              /**< (DBGU_EXID) Chip ID Extension Register Offset */
#define DBGU_FNR_REG_OFST              (0x48)              /**< (DBGU_FNR) Force NTRST Register Offset */
#define DBGU_WPMR_REG_OFST             (0xE4)              /**< (DBGU_WPMR) Write Protection Mode Register Offset */
#define DBGU_VERSION_REG_OFST          (0xFC)              /**< (DBGU_VERSION) Version Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief DBGU register API structure */
typedef struct
{
  __O   uint32_t                       DBGU_CR;            /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       DBGU_MR;            /**< Offset: 0x04 (R/W  32) Mode Register */
  __O   uint32_t                       DBGU_IER;           /**< Offset: 0x08 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       DBGU_IDR;           /**< Offset: 0x0C ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       DBGU_IMR;           /**< Offset: 0x10 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       DBGU_SR;            /**< Offset: 0x14 (R/   32) Status Register */
  __I   uint32_t                       DBGU_RHR;           /**< Offset: 0x18 (R/   32) Receive Holding Register */
  __O   uint32_t                       DBGU_THR;           /**< Offset: 0x1C ( /W  32) Transmit Holding Register */
  __IO  uint32_t                       DBGU_BRGR;          /**< Offset: 0x20 (R/W  32) Baud Rate Generator Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       DBGU_RTOR;          /**< Offset: 0x28 (R/W  32) Receiver Timeout Register */
  __I   uint8_t                        Reserved2[0x14];
  __I   uint32_t                       DBGU_CIDR;          /**< Offset: 0x40 (R/   32) Chip ID Register */
  __I   uint32_t                       DBGU_EXID;          /**< Offset: 0x44 (R/   32) Chip ID Extension Register */
  __IO  uint32_t                       DBGU_FNR;           /**< Offset: 0x48 (R/W  32) Force NTRST Register */
  __I   uint8_t                        Reserved3[0x98];
  __IO  uint32_t                       DBGU_WPMR;          /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint8_t                        Reserved4[0x14];
  __I   uint32_t                       DBGU_VERSION;       /**< Offset: 0xFC (R/   32) Version Register */
} dbgu_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_DBGU_COMPONENT_H_ */
